"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""               
"               
"               ██╗   ██╗██╗███╗   ███╗██████╗  ██████╗
"               ██║   ██║██║████╗ ████║██╔══██╗██╔════╝
"               ██║   ██║██║██╔████╔██║██████╔╝██║     
"               ╚██╗ ██╔╝██║██║╚██╔╝██║██╔══██╗██║     
"                ╚████╔╝ ██║██║ ╚═╝ ██║██║  ██║╚██████╗
"                 ╚═══╝  ╚═╝╚═╝     ╚═╝╚═╝  ╚═╝ ╚═════╝
"               
""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""" 

" Отключить совместимость с vi, так как может вызвать непредвиденные проблемы
set nocompatible

" Включить определение типа файла. Vim сможет попытаться определить тип используемого файла
filetype on

" Включить плагины и загрузить плагин для обнаруженного типа файла
filetype plugin on

" Загрузить файл отступа для обнаруженного типа файла
filetype indent on

" Включить подсветку синтаксиса
syntax on

" Добавить числа в каждую строку слева
set number

" Включить относительную нумерацию
set relativenumber

" Выделить линию курсора под курсором по горизонтали
" set cursorline

" Выделить линию курсора под курсором по вертикали 
" set cursorcolumn

" Установить ширину сдвига в 4 пробела
set shiftwidth=4

" Установить ширину табуляции в 4 столбца
set tabstop=4

" Не сохранять файлы резервных копий
set nobackup

" Не допускать прокрутки курсора ниже или выше N строк при прокрутке
set scrolloff=10

" Не переносить строкои. Длинные строоки должны быть до конца
set nowrap

" При поиске по файлу подсвечивать совпадающие символы по мере ввода
set incsearch

" Игнорировать заглавные буквы при поиске
set ignorecase

" Показывать часть команды, которую вы вводите в последней строке экрана
set showcmd

" Показывать текущий режим на последней строке
set showmode

" Показывать совпадающие слова во время поиска
set showmatch

" Использовать подсветку при поиске
set hlsearch

" Использовать меню автодополнений после нажатия TAB
set wildmenu

" Сделать wildmenu похожим на автодополнение в Bash
set wildmode=list:longest

" Использовать системный буфер по умолчанию для копирования/вставки
set clipboard^=unnamed,unnamedplus

" PLUGINS -----------------------------------------------------------------------------------------{{{

call plug#begin('~/.vim/plugged')

	Plug 'dense-analysis/ale'

	Plug 'preservim/nerdtree'

call plug#end()

" }}}


" MAPPING ---------------------------------------------------------------------------------------- {{{

" Использовать пробел как лидер клавишу
let mapleader = " "

" Какая-то бесполезная хуйня, тип возвращает курсор на предыдущую позицию
nnoremap <leader>\ ``

" Нажмите jj для быстрого выхода из режима вставки
" inoremap jj <Esc>

" Вы можете разделить окно в Vim, набрав :split или :vsplit
" Упрощенная навигация по разделенному виду с помощью сочетания клавиш CTRL+jkhl
nnoremap <C-j> <c-w>j
nnoremap <C-k> <c-w>k
nnoremap <C-h> <c-w>h
nnoremap <C-l> <c-w>l

" Изменяйте размер разделенных окон с помощью клавиш со стрелками
noremap <C-up> <c-w>+
noremap <C-down> <c-w>-
noremap <C-left> <c-w>>
noremap <C-right> <c-w><

" Сочетание клавиш для сохранения и выхода из файла
nnoremap <C-s> :w<CR>
nnoremap <leader>w :w<CR>
nnoremap <C-q> :q<CR>

" Специфические сопоставления NERDTree
" Назначить пробел + e для открытия и закрытия
nnoremap <leader>e :NERDTreeToggle<cr>

" }}}


" VIMSCIPT --------------------------------------------------------------------------------------- {{{

" Включить маркерный метод сворачивания
augroup filetype_vim
	autocmd!
	autocmd FileType vim setlocal foldmethod=marker
augroup END

" Если текущий тип файла - HTML, то установить отступ в 2 пробела
autocmd FileType html setlocal tabstop=2 shiftwidth=2 expandtab

" Если версия Vim равна или больше 7.3, включить undofile
" Это позволяет отменить изменения в файле даже после его сохранения
if version >= 703
	set undodir=~/.vim/backup
	set undofile
	set undoreload=10000
endif

" Вы можете разделить экран на разделы, введя :split или :vsplit
" Отображать линию курсора и столбец курсора ТОЛЬКО в активном окне
augroup cursor_off
	autocmd!
	autocmd WinLeave * set nocursorline nocursorcolumn
	autocmd WinEnter * set cursorline cursorcolumn
augroup END

" Если запущена графическая версия Vim, установить след параметры
"if has('gui_running')
	
	" Установить тон фона
	set background=dark

	" Установить цветовую схему
	colorscheme molokai

	" Установить шрифт, установленный на пк
	" Синтаксис: set guifont=<имя>\ <жирность>\ <размер>
	set guifont=Monospace\ Regular\ 12

	" Отображать большую часть файла по умолчанию
	" Скрыть панель инструментов
	set guioptions-=T

	" Скрыть левую полосу прокрутки
	set guioptions-=L

	" Скрыть правую полосу прокрутки
	set guioptions-=r

	" Скрыть строку меню
	set guioptions-=m

	" Скрыть нижнюю полосу прокрутки
	set guioptions-=b

	" Назначить на пробел + i переключение между меню, панелью инструментов и
	" полосой прокрутки
	" <Bar> - символ вертикальной черты
	" <CR> - клавиша Enter
	nnoremap <leader>m :if &guioptions=~#'mTr'<Bar>
		\set guioptions-=mTr<Bar>
		\else<Bar>
		\set guioptions+=mTr<Bar>
		\endif<CR>
"endif

" }}}


" STATUS LINE ----------------------------------------------------------------------------------- {{{

" Очистить строку статуса при перезагрузке .vimrc
set statusline=

" Левая часть строки статуса
set statusline+=\ %F\ %M\ %Y\ %R

" Использовать разделитель для отделения левой части от правой
set statusline+=%=

" Правая часть строки статуса
set statusline+=\ ascii:\ %b\ hex:\ 0x%B\ row:\ %l\ col:\ %c\ percent:\ %p%%

" Отображать статус на предпоследней строке
set laststatus=2

" }}}
